[{
        "title": "ERROR 404: Carmona aprobando not found",
        "id": "eins",
        "imgbig": "images/1.png",
        "imgmid": "images/1.png",
        "text": ["La asignatura esta de Prog3 yo diría que es “de órdago” en cuanto al tiempo que requiere, más que en cuanto a su posible dificultad. En su favor tiene que es enormemente interesante, o sea que “se deja estudiar”, por así decir.",
            "Unos consejillos que yo daría a quienes se acerquen por primera vez a ella serían los siguientes:",
            "1.- mentalizarse de que NO es difícil, PERO exije trabajar muchas horas en ella, tanto el estudio de la parte teórica como la realización de la práctica.",
            "2.- hacerse con los dos libros de la asignatura ,teoría y problemas (y estudirlos a conciencia, claro), así como con alguna colección de apuntes sobre esquemas algorítmicos y ejercicios resueltos de exámenes de otros años. Sobre todo el libro de problemas y los exámenes resueltos proporcionan muchas claves para salir “airosos” del examen.",
            "3.- Empezar a estudiar YA (no dejarlo para demasiado tarde). Los temas 1 a 4 pueden verse por encima al principio (lo importante es la notación asintótica y el análisis de algoritmos, sin demasiadas complicaciones matemáticas). Del resto se puede “pasar” olímpicamente, al principio, al menos.",
            "4.- A partir del tema 5 inclusive (estructuras de datos) meterse “a fondo” en materia.",
            "5.- En cuanto se haya visto a nivel teórico y en una primera pasada los tres esquemas fundamentales -Voraces, Divide y Vencerás, y Exploración de Grafos- (esto os llevará unas 4 ó 6 semanas, más o menos) meteros SIN PERDER UN MINUTO con la práctica (que os va a llevar su buen tiempo). Intentar resolverla antes de conocer los aspectos teóricos es COMPLETAMENTE INÚTIL y sólo os hará perder tiempo.",
            "6.- Integraros en “equipos” para hacer la práctica (o al menos para discutirla) es de gran ayuda. Claro que para eso ya estais en la lista de correo ¿no? :-))",
            "OJO con esto: la práctica es individual, aunque no creo que los profesores pongan pegas por discutir la práctica (que no hacerla) con otros alumnos, por ej en los propios cursos virtuales.",
            "7.- Si no estais “sueltos” con el Módula2 poneros al día a la velocidad de… YA !!",
            "Ahora se usa JAVA, pero aparte de ese detalle, el consejo sigue igual de válido.",
            "8.- En mi página web encontrareis las prácticas hechas de los dos cursos anteriores, así como material interesante de estudio.",
            "Saludos"
        ],
        "date": "05/03/2018 23:22:45"
    },
    {
        "title": "Flatulencias tan pestilentes que te harán desmayar",
        "id": "zwei",
        "imgbig": "images/2.jpg",
        "imgmid": "images/2.jpg",
        "text": ["Alguien me preguntó",
            "¿Qué es un pedo?",
            "y yo le contesté muy quedo:",
            "el pedo es un pedo,",
            "con cuerpo de aire y corazón de viento.",
            "El pedo es como un alma en pena,",
            "que a veces sopla,",
            "que a veces truena.",
            "Es como el agua que se desliza,",
            "con mucha fuerza, con mucha prisa.",
            "El pedo es como la nube que va volando,",
            "y por donde pasa va fumigando.",
            "El pedo es vida,",
            "el pedo es muerte,",
            "y tiene algo que nos divierte.",
            "El pedo gime, el pedo llora,",
            "el pedo es aire, el pedo es ruido,",
            "y a veces sale por un descuido.",
            "El pedo es fuerte, es imponente,",
            "pues se los tira toda la gente.",
            "En este mundo un pedo es vida,",
            "porque hasta el Papa bien se lo tira.",
            "Hay pedos cultos e ignorantes,",
            "los hay adultos, también infantes,",
            "hay pedos gordos, hay pedos flacos,",
            "según el diámetro de los tacos.",
            "Hay pedos tristes, los hay risueños,",
            "según el gusto que tiene el dueño.",
            "Si un día algún pedo toca tu puerta,",
            "no se la cierres, déjala abierta.",
            "Deja que sople, deja que gire,",
            "a ver si hay alguién que lo respire.",
            "También los pedos son educados,",
            "pues se los tiran los licenciados.",
            "El pedo tiene algo monstruoso,",
            "pues si lo aguantas te lleva al pozo.",
            "Este poema se ha terminado,",
            "con tanto pedo que me he tirado."
        ],
        "date": "23/12/2017 20:30:21"
    },
    {
        "title": "Hetzer und Kinderschänder",
        "id": "drei",
        "imgbig": "images/3.png",
        "imgmid": "images/3.png",
        "text": ["Verdrängen, aussitzen, vergessen – das ist die Taktik eines 44-jährigen Meißners. Der Vorwurf gegen den Mann wiegt schwer. Der Arbeitslose soll in seiner Wohnung ein 13-jähriges Mädchen, das ein Kind von Bekannten ist und des Öfteren bei dem Angeklagten und dessen Frau weilte, sexuell missbraucht haben. Er soll sich kurz nach Mitternacht an das Bett des Kindes herangeschlichen und es dabei an verschiedenen Körperstellen unsittlich berührt haben. Das Kind hatte mit dem Handy die Polizei gerufen. Die Aussagen des Mädchens sind konstant. Eine Aussage vor Gericht wollte die Richterin dem Kind ersparen, hoffte wohl auf ein Geständnis des Angeklagten, hatte die 13-Jährige deshalb zunächst nicht als Zeugin geladen. Doch er gestand nichts. Stattdessen gab er an, total betrunken gewesen zu sein, sich an nichts mehr erinnern zu können. So wurde ein zweiter Termin angesetzt, bei dem die 13-Jährige nun doch als Zeugin vernommen werden sollte. Wer diesmal nicht kam, war der Angeklagte. Er glaubte wohl, sich der Verhandlung entziehen zu können, legte einen Krankenschein eines seiner Kinder vor. Er müsse zu Hause bleiben und das Kind pflegen, ließ er ausrichten. Bei seinem Pflichtverteidiger, der ihm zwischenzeitlich zugeordnet wurde, hatte er sich auch nicht blicken lassen.",
            "Das Gericht verhängt per Strafbefehl wegen sexuellen Missbrauchs eines Kindes eine Gefängnisstrafe von zehn Monaten, die zur Bewährung ausgesetzt wird. Von sich aus legt der Verteidiger vorsorglich Einspruch ein. Nun wird doch noch verhandelt. Diesmal ist der Angeklagte da. Doch auch diesmal hatte er es nicht für nötig gehalten, sich bei seinem Verteidiger zu melden. Der sieht ihn 30 Minuten vor Verhandlungsbeginn das erste Mal. Und der Angeklagte bleibt dabei: Er könne sich an nichts mehr erinnern, wisse nur noch, dass er in der Küche Bier tank und könne sich erst wieder erinnern, als ihn seine Frau weckte, weil die Polizei vor der Tür stand, sagt er. Er akzeptiere aber die Strafe, „damit er seine Ruhe habe“, trägt der Anwalt vor. Da nimmt einer eine zehnmonatige Haftstrafe in Kauf, obwohl er die Tat gar nicht begangen hat? Richterin und Staatsanwältin machen dem Mann klar, dass das nicht geht. Tatsächlich war der Mann zur Tatzeit betrunken. Eine Blutprobe ergab einen Alkoholwert von 2,21 Promille. Das ist allerdings nicht viel für den alkoholgewöhnten Meißner. Wenn er sich betrinke und dann Straftaten begehe, käme für ihn auch die Unterbringung in einer Entziehungsanstalt infrage, macht die Staatsanwältin deutlich.",
            "Nach einem Gespräch mit seinem Anwalt zieht der Angeklagte den Einspruch gegen den Strafbefehl zurück. Damit gesteht er die Tat praktisch ein. Mit den zehn Monaten ist er da noch gut bedient. Welche Auswirkungen die Tat auf das geschädigte Kind hat, darüber macht er sich offenbar überhaupt keine Gedanken. „Meine Tochter leidet noch heute unter den psychischen Problemen, ist in sich gekehrt, verstört, ganz anders als vorher. Bis zu dieser Tat war sie ein aufgewecktes, lebenfreudiges Mädchen“, so die Mutter. Die Familie des Kindes hat den Kontakt zu dem Mann längst abgebrochen. Der wurde auch schon wegen Volksverhetzung zu einer Geldstrafe verurteilt. Er hatte u. a. ein Hitlerbild gepostet mit der Unterschrift: „Vermisst seit 1945. Adolf, bitte melde dich, Deutschland braucht dich!“ Nach der Verurteilung braucht sich der Meißner wohl nicht mehr bei seinen Gesinnungsgenossen blicken zu lassen. Die fordern schließlich: „Todesstrafe für Kinderschänder.“"
        ],
        "date": "09/04/2018 17:23:44"
    },
    {
        "title": "This Is Why Doughnuts Are Associated With Police Officers",
        "id": "vier",
        "imgbig": "images/4.png",
        "imgmid": "images/4.png",
        "text": [
            "On National Doughnut Day on Friday, the sweet treat’s biggest fans will celebrate by taking advantage of doughnut shops’ deals for free or discounted goods, while police departments will inevitably poke fun at this “national holiday for police officers” on social media.",
            "By now, the stereotype of the doughnut-loving cop is well-established — but how did it start?",
            "The short answer is that police officers have long worked odd hours, but the options for food in the wee hours haven’t always been plentiful. The option to pick up a doughnut dates to the years after World War II.",
            "“Graveyard cops in the forties and fifties had few choices. They could pack lunch, pray for an all-night diner on their route or fill up on doughnuts,” Norm Stamper, the former chief of the Seattle Police Department, says in The Donut: History, Recipes, and Lore from Boston to Berlin by Michael Krondl. “They were cheap and convenient.” Former Baltimore City police detective Dick Ellwood likewise recalled being allowed to just eat doughnuts off the assembly line shortly after the shops opened in the wee hours of the morning.",
            "“The early-hours doughnut shop is a post-World War I phenomenon in major cities and did not spread to most of the remainder of the country until after World War II, so the stereotype of an overweight officer drinking burnt coffee and eating a glazed doughnut is a relatively recent creation,” Paul Mullins, a professor of Anthropology at Indiana University-Purdue University, Indianapolis, and author of Glazed America: A History of the Doughnut, told TIME in an email.",
            "In addition, he pointed out, it matters that doughnuts are cheap: cops aren’t supposed to accept any free gifts while on duty, so it makes sense that they’d decide to spend their own snack money on something affordable.",
            "And, especially at those odd hours of the night, the doughnut shops actively tried to entice police officers to stop in for a snack. In his autobiography, Dunkin’ Donuts founder William Rosenberg claimed he wanted to make sure franchises were “hospitable places for the police” who “protected the stores.”",
            "As late-night food options expanded, police came to be able to eat other things, but the joke stuck."
        ],
        "date": "03/01/2017 12:11:34"
    },
    {
        "title": "Asesinaron a cuchilladas a una joven trans de San Luis",
        "id": "funf",
        "imgbig": "images/5.png",
        "imgmid": "images/5.png",
        "text": ["El cuerpo de Adrián Ponce fue encontrado este miércoles alrededor de las 5:50 en un edificio ubicado en Rincón al 150, informó La Voz.",
            "La joven estaba cuidando la habitación de otra compañera que estaba de viaje. Fue otra joven trans quien encontró el cuerpo y dio aviso a la Policía, según contó a La Voz Celeste Giacchetta, titular de la Asociación de Travestis Transexuales y Transgéneros de Argentina (ATTTA) Córdoba.",
            "Fuentes cercanas a la investigación indicaron que la víctima fue apuñalada y que en el lugar también encontraron un perro muerto.",
            "Según Giacchetta, el cuerpo de Ponce estaba en el ingreso del edificio, mientras que su perro fue encontrado en la habitación que estaba cuidando.",
            "Giacchetta contó que Ponce era de San Luis, hacía varios años que vivía en Córdoba y ejercía el trabajo sexual. Su familia está viajando a Córdoba.",
            "“Nos hace acordar tanto a otro caso de crimen impune ocurrido años atrás que es el de Cindy, que fue muy similar, con puñaladas, con alevosía”, señaló Giacchetta.",
            "Desde ATTTA advierten sobre una seguidilla de hechos violentos contra mujeres trans. “El mes pasado una chica fue apuñalada, otra chica fue arrastrada por un taxista. Pareciera que volvimos atrás en calidad de vida. Están volviendo a pasar cosas. Seguimos totalmente expuestas. La impunidad es porque hay ausencia”, dijo Giacchetta."
        ],
        "date": "04/01/2017 00:03:11"
    },
    {
        "title": "Fork an example repository",
        "id": "sechs",
        "imgbig": "images/6.png",
        "imgmid": "images/6.png",
        "text": ["Forking a repository is a simple two-step process. We've created a repository for you to practice with!",
            "On GitHub, navigate to the octocat/Spoon-Knife repository.",
            "Fork buttonIn the top-right corner of the page, click Fork.",
            "That's it! Now, you have a fork of the original octocat/Spoon-Knife repository."
        ],
        "date": "22/03/2018 03:02:01"
    },
    {
        "title": "El baile de cortejo del ave del paraíso",
        "id": "sieben",
        "imgbig": "images/7.png",
        "imgmid": "images/7.png",
        "text": [
            "El nombre “ave del paraíso” designa a 41 especies diferentes del orden Passeriformes y de la familia Paradisaeidae, distribuídas por el continente de Oceanía, siendo el mayor foco de concentración la isla de Nueva Guinea.",
            "Son aves tropicales apreciadas por su espectacular belleza, siendo sus plumas usadas para vestimenta y rituales de tribus de la zona.",
            "Este pájaro, de comportamiento solitario y muy territorial, se alimenta de frutos e insectos. Su dieta puede ir más allá, ya que algunos ejemplares han sido vistos atrapando ranas o incluso pequeños reptiles y polluelos de otras especies.",
            "Sin embargo, una de sus características más destacables, y que es por lo que generalmente se le conoce, es su peculiar danza de cortejo. Los machos van bailando, de rama en rama, demostrando sus habilidades delante de las hembras, que se aparearán con el mejor bailarín."
        ],
        "date": "10/08/2016 08:11:34"
    },
    {
        "title": "¿Qué es el Software Libre?",
        "id": "acht",
        "imgbig": "images/8.jpg",
        "imgmid": "images/8.jpg",
        "text": ["Software Libre se refiere a la libertad de los usuarios para ejecutar, copiar, distribuir, estudiar, cambiar y mejorar el software. De modo más preciso, se refiere a cuatro libertades de los usuarios del software:",
            "La libertad de usar el programa, con cualquier propósito (libertad 0).",
            "La libertad de estudiar cómo funciona el programa, y adaptarlo a tus necesidades (libertad 1). El acceso al código fuente es una condición previa para esto.",
            "La libertad de distribuir copias, con lo que puedes ayudar a tu vecino (libertad 2).",
            "La libertad de mejorar el programa y hacer públicas las mejoras a los demás, de modo que toda la comunidad se beneficie. (libertad 3). El acceso al código fuente es un requisito previo para esto.",
            "Un programa es software libre si los usuarios tienen todas estas libertades. Así pues, deberías tener la libertad de distribuir copias, sea con o sin modificaciones, sea gratis o cobrando una cantidad por la distribución, a cualquiera y a cualquier lugar. El ser libre de hacer esto significa (entre otras cosas) que no tienes que pedir o pagar permisos."
        ],
        "date": "12/02/2018 09:18:18"
    },
    {
        "title": "Los Centauros",
        "id": "neun",
        "imgbig": "images/9.png",
        "imgmid": "images/9.png",
        "text": ["Los centauros eran criaturas con la cabeza y el cuerpo de un hombre, pero con el resto del cuerpo semejante al de un caballo. Descendían de Ixión, el primer humano que mató a uno de los miembros de su familia y que concibió a centauro, el primero de ellos, cerca de una nube a la que Zeus ha­bía dado la forma de su esposa Hera.",
            "Los centauros vivían en los bosques que rodeaban el monte Pelión en Tesalea y se les consideraba bestias sin civilizar. Siempre estuvieron en conflicto con la localidad vecina de Lapithae, ya que durante la boda de su rey Pirithous (Pirito) habían acudido para raptar a la novia y a otras mujeres. La batalla que se desencadenó acabó con la vida de muchos centauros. Los héroes Teseo y Néstor lucharon en este conflicto y este último, que vivió durante muchos años, contó diversas historias épicas sobre el evento.",
            "Quirón fue un centauro fuera de lo normal debido a su personalidad cultivada que le permitía educar a muchos dioses y héroes.",
            "Heracles tuvo varios enfrentamientos muy violentos con los centauros. En cierta ocasión, cuando había sido invitado por el centauro Pholus (Folo) y se encontraba ca­zando al jabalí Erimanthische (Erimantisque), se quejó de que no le habían servido vino pese a que había una jarra llena al lado. Folo le dijo que Dioniso quería que el vino fuese servido antes a todos los centauros, que una vez destapada la jarra acudieron al olor de su aroma. Así empezó una pelea en la que Heracles mató a varios cen­tauros con sus flechas venenosas. También murió su anfitrión Folo e incluso una flecha se clavó accidentalmente en el cuerpo de Quirón, que sufrió dolores tan agudos que tuvo finalmente que renunciar a su inmortalidad.",
            "El centauro Neso fue el que llevó a cabo la venganza sobre Heracles. Después de un primer intento de violar a Dejaneira, su mujer, y recibir un flechazo mortal, el vengador diseñó un plan muy astuto. Acudió a Deianeira para susurrarle un método eficaz en caso de que Heracles perdiese interés por ella, indicándole que tomase parte de la sangre que manaba de su herida para que en el momento en el que tuviese dudas de él vertiese un poco sobre sus ropas. De esta manera nunca le podría ser infiel. Así guardó una jarra con la sangre de Neso sin que lo supiese su marido.",
            "Años después, cuando la incertidumbre y los celos se apoderaron de ella, Deianeira siguió el consejo de Neso con desastrosas consecuencias. Al ir a ponerse sus ropas cubiertas de sangre, Heracles sufrió quemaduras que le causaron una muerte extremadamente dolorosa"
        ],
        "date": "01/01/323 12:33:02"
    },
    {
        "title": "Un nuevo descubrimiento permite diagnosticar la narcolepsia con la ayuda de perros adiestrados",
        "id": "zen",
        "imgbig": "images/10.jpg",
        "imgmid": "images/10.jpg",
        "text": ["La unidad canina de la Guardia Civil ha conseguido adiestrar a varios perros que detectan a enfermos de narcolepsia, personas que sufren trastornos del sueño. Un médico de la clínica Ruber descubrió que tienen un olor especial. El objetivo es la detección precoz, ya que hasta la fecha, de media se suele tardar unos 10 años en diagnosticar la enfermedad.",
            "Kuns y Coca son dos perros que estaban entrenados para detectar drogas y explosivos pero ahora han pasado a colaborar con la medicina.",
            "Su desarrollado olfato es la clave. Acaban de detectar qué compartimento contiene la gasa impregnada con el olor corporal de un paciente con narcolepsia, un trastorno del sueño. Un olor, especial, que permitió al Doctor Domínguez, de la clínica Ruber y su equipo iniciar la investigación.",
            "“Los narcolépticos tienen la suerte de tener, como todos, un olor corporal pero con un matiz especial que les caracteriza”, afirma.",
            "El doctor presentó una propuesta de colaboración a la Guardia Civil y le dieron el visto bueno. Dos años y medio después y 250 muestras analizadas han demostrado que los perros ayudan a una detección precoz de la enfermedad.",
            "Aunque los comienzos no fueron fáciles. “Fueron muy difíciles por el hecho de que no sabíamos lo que los perros tenían que encontrar”, señala el cabo de la Guardia Civil, Jonathan Vilarino.",
            "El reto, permitirá mejorar la calidad de vida de estos enfermos y también abre, dicen los investigadores, nuevas vías para identificar más enfermedades neurológicas en un futuro."
        ],
        "date": "03/05/2018 16:29:35"
    }
]